In [1]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [2]:
import numpy as np
import pandas as pd

# Estructuras de Datos

#### PANDAS MANEJA ESTRUCTURAS DE DATOS ESPECIALES PARA REPRESENTAR TABLAS Y OTROS TIPOS DE DATOS ORDENADOS

## Series

In [3]:
# Es un objeto que representa una serie de datos conectados a una descripción de los mismos
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
# ATRIBUTOS DE UN OBJETO SERIES

# Valores que guarda
obj.values

# Etiqueta que identifica a cada valor del Series
obj.index

array([ 4,  7, -5,  3])

RangeIndex(start=0, stop=4, step=1)

In [5]:
# El Index puede ser especificado en la definición
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
# Podemos seleccionar/asignar un valor de un Series haciendo referencia a su índice

obj2['a'] # Los índices son strings...
obj2[2] # o enteros

obj2['d'] = 2 # Asignación

obj2[['c', 'a', 'd']] # Fancy indexing

-5

-5

c    3
a   -5
d    2
dtype: int64

In [7]:
# Podemos realizar operaciones que realizamos con ndarrays de NumPy
obj2[obj2 > 0] # Boolean indexing

obj2 * 2 # Multiplicación escalar

np.exp(obj2) # Aplicar ufuncs

d    2
b    7
c    3
dtype: int64

d     4
b    14
a   -10
c     6
dtype: int64

d       7.389056
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [8]:
# Podemos crear Series desde diccionarios
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [9]:
# Incluso podemos especificar el orden en el que queremos que estén los índices
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states) # California aparece como NaN
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [10]:
# Podemos hacer operaciones entre Series
obj3
obj4
obj3+obj4 # Los índices se ordenan automáticamente

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [11]:
# Podemos cambiar el nombre tanto de las etiquetas como de los valores del Index
obj4.name = "population" # ¿Qué estamos guardando?
obj.index.name = "state" # ¿A qué pertenecen estos valores?
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## DataFrame

In [12]:
# CREACIÓN DE DATAFRAMES
# Representan tablas de datos
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year': [2000, 2001, 2002, 2001, 2001, 2003],
       'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2001  2.9
5  Nevada  2003  3.2

In [13]:
# Podemos especificar el orden de las columnas al definir un DataFrame
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2001  Nevada  2.9
5  2003  Nevada  3.2

In [14]:
# Igualmente podemos especificar el orden de los índices
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [15]:
# ACCESO Y ASIGNACIÓN
# Podmeos acceder a una columna de dos maneras_
# Por etiqueta
frame2['state']
# Como atributo
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [16]:
# Podemos asignar valores al DataFrame
frame2
frame2['debt'] = 16.6 # Asignación de escalares...
frame2
frame2['debt'] = np.arange(6.) # o de arrays (¡cuidado con la longitud!)
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2001  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

       year   state  pop  debt
one    2000    Ohio  1.5  16.6
two    2001    Ohio  1.7  16.6
three  2002    Ohio  3.6  16.6
four   2001  Nevada  2.4  16.6
five   2001  Nevada  2.9  16.6
six    2003  Nevada  3.2  16.6

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2001  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [17]:
# NUEVAS COLUMNAS
# Si asignamos a una columna inexsistente, se creará
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   0.0     True
two    2001    Ohio  1.7   1.0     True
three  2002    Ohio  3.6   2.0     True
four   2001  Nevada  2.4   3.0    False
five   2001  Nevada  2.9   4.0    False
six    2003  Nevada  3.2   5.0    False

In [18]:
# Podemos remover las columnas usando la palabra clave "del"
del frame2['eastern']
frame2.columns # Atributo de la clase DataFrame (es un Index)

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [19]:
# ATRIBUTOS DE UN DATAFRAME
pop = {
    'Nevada': {2001: 2.4, 2002: 2.9},
    'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}
}
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [20]:
# Atributos "Nombre del índice" y "Nombre de las columnas"
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3.values # Sólo los valores
frame3 # Valores y etiquetas

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

# Operaciones con Estructuras de Datos

## Indexing

In [21]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [22]:
# EXISTEN MUCHAS FORMAS DE REFERENCIAR UN VALOR
obj['b'] # Por etiqueta
obj[1] # Por número entero (por posición)
obj[1:3] # Slicing de posiciones (el último valor NO se incluye)
obj['b':'d'] # Slicing de etiquetas (el último valor se incluye)
obj[['b', 'a', 'd']] # Por lista de etiquetas
obj[obj < 2] # Por indexado booleano ("boolean indexing")

1.0

1.0

b    1.0
c    2.0
dtype: float64

b    1.0
c    2.0
d    3.0
dtype: float64

b    1.0
a    0.0
d    3.0
dtype: float64

a    0.0
b    1.0
dtype: float64

In [23]:
# Asignar a un slice modifica el Series original
obj['b': 'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [24]:
# INDEXING EN DATAFRAMES
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [25]:
# Básicamente es lo mismo...
data['two'] # Por etiqueta
data[['three', 'one']] # BPor lista de etiquetas
data[:2] # Slicing
data[data['three']>5] # Indexado booleano (máscara es un Series)

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [26]:
# También podemos asignar utilizando cualquiera de los métodos anteriores
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

## Selection (loc e iloc)

In [27]:
# EXISTE UN PROBLEMA: ¿Y SI TENEMOS ETIQUETAS QUE SON NUMÉRICAS?
# ¿HAGO INDEXING POR ETIQUETA O POR NÚMERO?
# UNA BUENA PRÁCTICA ES UTILIZAR LOC() E ILOC()
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
# loc() selecciona por etiquetas
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [29]:
# iloc() is para selección por enteros/por posición
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [30]:
data.iloc[[1, 2, 3], [3, 0, 1]] # No es Fancy Indexing

          four  one  two
Colorado     7    0    5
Utah        11    8    9
New York    15   12   13

In [31]:
# TAMBIÉN PODEMOS UTILIZAR SLICES CON ESTAS FUNCIONES
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [32]:
# No podemos utilizar indexado booleano dentro de iloc
data.iloc[:, :3][data.three > 5] # Filtramos > 5 después

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

## Reindexing

In [33]:
# REINDEX EN SERIES
# Podemos definir el índice al crear
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [34]:
# reindex devuelve un objeto con los índices en un orden escpecífico
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e']) # Nota: Valores NaN debido a que "e" no existe
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [35]:
# Podemos lidiar con los valores NaN de la siguiente manera
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3
# La opción ffill permite copiar valores no NaN anteriores
obj3.reindex(range(6), method='ffill')

0      blue
2    purple
4    yellow
dtype: object

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [36]:
# REINDEX EN DATAFRAMES
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [37]:
# Hacer reindex en el índice es los mismo
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [38]:
# Aunque tenemos la posibilidad de hacer reindex por columnas
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

## Dropping

In [39]:
# DROPPING EN SERIES
obj = pd.Series(np.arange(5), index=['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int64

In [40]:
# drop crea un nuevo objeto sin el valor cuyo índice se especificó
new_obj = obj.drop('c') # Elimina valor con índice c
new_obj
obj.drop(['d', 'c']) # Elimina valores con índices d y c

a    0
b    1
d    3
e    4
dtype: int64

a    0
b    1
e    4
dtype: int64

In [41]:
# DROPPING EN DATAFRAMES
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [42]:
# Eliminar filas (por default)
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [43]:
# Eliminar columnas
data.drop('two', axis=1)
data.drop(['two', 'four'], axis='columns')

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [44]:
# ¡EL DROP PUEDE NO CREAR UN OBJETO NUEVO!
obj # Antes
obj.drop('c', inplace=True) # Opción inplace=True
obj # Después

a    0
b    1
c    2
d    3
e    4
dtype: int64

a    0
b    1
d    3
e    4
dtype: int64

## Ordenamiento/Sorting

In [45]:
# SORTING EN SERIES
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index() # Ordena lexicográficamente

a    1
b    2
c    3
d    0
dtype: int64

In [46]:
# SORTING EN DATAFRAMES
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
                    index=['three', 'one'],
                    columns=['d', 'a', 'b', 'c'])
frame.sort_index() # Ordenar filas (por default)
frame.sort_index(axis=1) # Ordenar columnas

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [47]:
# Cambia el orden de ordenamiento (ascendente por defecto)
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [48]:
# ORDENAR POR VALORES, NO POR ÍNDICE
obj = pd.Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [49]:
# En DataFrames, ordenamos usando una columna como criterio
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame
frame.sort_values(by='b')

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

## Aplicación de Funciones

In [50]:
# UFUNCS
# Podemos utilizar las ufuncs de Numpy en Series y DataFrames
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah    0.054366  1.383614 -0.377474
Ohio   -0.610997 -0.002943 -0.813307
Texas   0.230332  1.441411 -0.638424
Oregon -0.910910 -2.008442  0.823088

In [51]:
# Valor absoluto
np.abs(frame)

               b         d         e
Utah    0.054366  1.383614  0.377474
Ohio    0.610997  0.002943  0.813307
Texas   0.230332  1.441411  0.638424
Oregon  0.910910  2.008442  0.823088

In [52]:
# APLICANDO FUNCIONES DE MAPEO
f = lambda x: x.max() - x.min() # Rango de valores
frame.apply(f) # Retorna Series

b    1.141242
d    3.449854
e    1.636395
dtype: float64

In [53]:
# Aplicar función a lo largo de columnas (se aplica por defecto a las filas)
frame.apply(f, axis='columns') # Útil para Series de Tiempo

Utah      1.761089
Ohio      0.810365
Texas     2.079836
Oregon    2.831530
dtype: float64

In [54]:
# Podemos retornar DataFrames también
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f) # Retorna DataFrame

            b         d         e
min -0.910910 -2.008442 -0.813307
max  0.230332  1.441411  0.823088

## Operaciones

In [55]:
## ALINEAMIENTO AUTOMÁTICO
# ¿Cómo sabe Pandas cómo ordenar índices de dos objetos al sumarlos?
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index = ['a', 'c', 'e', 'f', 'g'])
s1
s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [56]:
# la f y g están después de e.
s1 + s2 # Hay valores NaN porque no hay índices comunes (d, f, g)

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [57]:
# DATAFRAMES
df1 = pd.DataFrame(np.arange(12.).reshape((3,4)),
                  columns=list('abcd'))
df2 = pd.DataFrame(np.arange(20.).reshape((4,5)),
                  columns=list('abcde'))
df2.iloc[1]['b'] = np.nan # Simulamos valores NaN
df1
df2
df1 + df2 # Muchos valores NaN

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [58]:
# Podemos solucionarlo con la opción fill_value
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

#### En general, es una buena práctica utilizar funciones add, sub, div, etcétera en vez de operadores +, -, /, entre otros

In [59]:
# Las funcioens tienen variantes 'r' que intercambian argumentos
df1.sub(df2) # df1 - df2
df1.rsub(df2) # df2 - df1

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1 -1.0  NaN -1.0 -1.0 NaN
2 -2.0 -2.0 -2.0 -2.0 NaN
3  NaN  NaN  NaN  NaN NaN

     a    b    c    d   e
0  0.0  0.0  0.0  0.0 NaN
1  1.0  NaN  1.0  1.0 NaN
2  2.0  2.0  2.0  2.0 NaN
3  NaN  NaN  NaN  NaN NaN

### Operaciones entre Series y DataFrames: Broadcasting

In [60]:
frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[1]
series
frame

b    3.0
d    4.0
e    5.0
Name: Ohio, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [61]:
# ¿Como funciona una resta de un objetos 2D y 1D?
frame - series # ¡¡¡Broadcasting!!!!

          b    d    e
Utah   -3.0 -3.0 -3.0
Ohio    0.0  0.0  0.0
Texas   3.0  3.0  3.0
Oregon  6.0  6.0  6.0

In [62]:
# Broadcasting a lo largo de columnas (por defecto es por filas)
series3 = frame['d']
series3
frame
frame.sub(series3, axis='index') # o axis=0, es lo mismo

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

# Calculando Estadísticas

In [63]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                  [np.nan, np.nan], [0.75, -1.3]],
                 index=['a', 'b', 'c', 'd'],
                 columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [64]:
# Sumas
df.sum()
df.sum(axis='columns')

one    9.25
two   -5.80
dtype: float64

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [65]:
# Valores mínimos y máximos
df.idxmax()

one    b
two    d
dtype: object

In [66]:
# Acumulaciones
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

## Descripción y más información

In [67]:
# describe arroja mucha información acerca de un DataFrame
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [68]:
# Descripción de valores no numéricos
obj = pd.Series(['a', 'a', 'b', 'c']*4)
obj
obj.describe()

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

count     16
unique     3
top        a
freq       8
dtype: object

## Valores únicos y Conteo

In [69]:
# ¿Qué valores se repiten?
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
uniques = obj.unique() # Ordenados según se avistaron por primera vez
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [70]:
# ¿Cuántas veces se repiten esos valores?
obj.value_counts() # Ordenados descendentemente

a    3
c    3
b    2
d    1
dtype: int64

In [71]:
# Estas funciones igual existen como funciones globales de Pandas
pd.value_counts(obj, sort=False)

b    2
c    3
d    1
a    3
dtype: int64

In [72]:
# UN PEQUEÑO EJEMPLO: ENCUESTA
# Dado una tabla que muestra las respuestas de diferentes personas...
data = pd.DataFrame({'Qu1': [1,3,4,3,4],
                    'Qu2': [2,3,1,2,3],
                    'Qu3': [1,5,2,4,4],})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [73]:
# ...queremos saber cuántas dieron qué respuesta
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## Correlación y Covarianza

Nota: Instalar pandas_datareader usando la consola:  
python3 -m pip install pandas-datareader

In [74]:
# Cargamos datos de Yahoo (stock prices and volumes)
import pandas_datareader.data as web
all_data = {ticker: web.get_data_yahoo(ticker)
           for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [75]:
# Calculamos el cambio porcentual de los precios (útil en Series de Tiempo)
returns = price.pct_change()
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2019-09-05  0.019552  0.034111  0.017583  0.025368
2019-09-06 -0.000094 -0.002837 -0.006783 -0.005324
2019-09-09  0.004267  0.014441 -0.011359 -0.000432
2019-09-10  0.011813  0.017181 -0.010471  0.001320
2019-09-11  0.031795 -0.009997  0.000294  0.011750

In [76]:
# Correlación y covarianza (1 v 1)
returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

0.49135934852806074

8.796569498033213e-05

In [77]:
# Matriz de correlación (Todos v Todos)
returns.corr()
# Matriz de covarianza
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.386122  0.457479  0.463748
IBM   0.386122  1.000000  0.491359  0.407093
MSFT  0.457479  0.491359  1.000000  0.539064
GOOG  0.463748  0.407093  0.539064  1.000000

          AAPL       IBM      MSFT      GOOG
AAPL  0.000267  0.000078  0.000108  0.000118
IBM   0.000078  0.000154  0.000088  0.000078
MSFT  0.000108  0.000088  0.000209  0.000121
GOOG  0.000118  0.000078  0.000121  0.000242

In [78]:
# Correlation 1 v Todos
returns.corrwith(returns['IBM']) # Retorna Series
returns.corrwith(volume) # Retorna DataFrame

AAPL    0.386122
IBM     1.000000
MSFT    0.491359
GOOG    0.407093
dtype: float64

AAPL   -0.063641
IBM    -0.152090
MSFT   -0.090154
GOOG   -0.019293
dtype: float64

# Cargado y Guardado de Datos

## CSV